#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.random_password.master_password[0]: Refreshing state... [id=none]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=PXuzYA]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_app.ansible: Refreshing state... [id=e4e50686-b226-40c1-800b-a64addd693c1:ansible-app-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codepipeline_role: Refreshing state... [id=codepipeline_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.ansible_ec2_role: Refreshing state... [id=ec2_ansible_role-dev]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Reading...
module.us-east-1.data.aws_ami.ubuntu2004: Reading...
module.us-east-1.aws_key_pair.terraform-aws: Refreshing state... [id=terraform-aws-dev]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=grafana-rds-dev-20220826071900561400000001]
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.us-east-1.data.aws_availability_zones.az_zones: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codedeploy_role: Refreshing state... [id=ansible_codedeploy_role-dev]
module.us-east-1.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-057288cbe12a3241a]
module.us-east-1.data.aws_ami.ubuntu2004: Read complete after 0s [id=ami-0cf6c10214cc015c9]
module.us-east-1.module.platform.module.ansible_server.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::023093918714:oidc-provider/token.actions.githubusercontent.com]
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.us-east-1.data.aws_ami.amazon_linux_2: Reading...
module.us-east-1.data.aws_availability_zones.az_zones: Read complete after 0s [id=us-east-1]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_config.ansible: Refreshing state... [id=ansible-deployment-config-dev]
module.us-east-1.module.platform.module.ansible_server.aws_kms_key.ansible_bucket_key: Refreshing state... [id=426dee1a-1411-4848-86d7-00559cb93f5f]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b6a9d9da5278f304]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role.github_role: Refreshing state... [id=github_ansible_role-dev]
module.us-east-1.module.platform.module.ansible_server.aws_kms_alias.key_alias: Refreshing state... [id=alias/ansible-bucket-key]
module.us-east-1.data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0cabc39acf991f4f1]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy_attachment.AWSCodeDeployRole: Refreshing state... [id=ansible_codedeploy_role-dev-20220826071901263000000002]
module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_group.ansible: Refreshing state... [id=cb39e749-4574-42d6-ab00-fcdc1555ed82]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy_inventory: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy_inventory-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_instance_profile.ansible_ec2_profile: Refreshing state... [id=ec2_ansible_profile-dev]
module.us-east-1.module.platform.aws_security_group.allow_outbound: Refreshing state... [id=sg-06d072446c1659744]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.grafana_http_instance: Refreshing state... [id=sg-0f7851c5f42fbdba8]
module.us-east-1.module.zones.aws_route53_zone.this["dev.private.ktech-br.com"]: Refreshing state... [id=Z092901114WC1S1Z6MLWG]
module.us-east-1.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0b67eef80709868b3]
module.us-east-1.module.platform.module.bastion.aws_security_group.bastion_public_ssh: Refreshing state... [id=sg-04ecf420f20362e1e]
module.us-east-1.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-093b3509df974dfd4]
module.us-east-1.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-01638e156a2acbe49]
module.us-east-1.module.platform.aws_security_group.allow_ping: Refreshing state... [id=sg-0f48e46630979d25f]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_http: Refreshing state... [id=sg-0f64dadaff4382374]
module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_https: Refreshing state... [id=sg-0fa8a44234f244f0d]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06f2a2d1d405e2ede]
module.us-east-1.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-031c10a7b7f076e62]
module.us-east-1.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00937a690e6c083b5]
module.us-east-1.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d1cb136b08e88177]
module.us-east-1.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08ad62b02168826c0]
module.us-east-1.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c75c958995362234]
module.us-east-1.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06868f6060fc9ca8f]
module.us-east-1.module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0af1957293a80fea2]
module.us-east-1.module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0050e98ea2b38bbd4]
module.us-east-1.module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-025c963e790930880]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_acl.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev,private]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy: Refreshing state... [id=ec2_ansible_role-dev:ec2_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.github_policy: Refreshing state... [id=github_ansible_role-dev:github_ansible_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.codepipeline_policy: Refreshing state... [id=codepipeline_ansible_role-dev:codepipeline_policy-dev]
module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_versioning.codepipeline_bucket: Refreshing state... [id=codepipeline-ansible-ktech-br-dev]
module.us-east-1.module.platform.module.ansible_server.aws_codepipeline.codepipeline: Refreshing state... [id=ansible-deploy-pipeline-dev]
module.us-east-1.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-085fa490cb445ed3b]
module.us-east-1.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08fa7cd6f3288ddd7]
module.us-east-1.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0cffd49ef6db4b743]
module.us-east-1.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d1cb136b08e881771080289494]
module.us-east-1.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01413ceb9d8b86546]
module.us-east-1.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08449037dc4b21055]
module.us-east-1.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02229772beed281a7]
module.us-east-1.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04f8986ebe4ecaff0]
module.us-east-1.module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-us-east-1-dev]
module.us-east-1.module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0bb44ca075ed0aa5e]
module.us-east-1.module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-04fdb100b0f787d19]
module.us-east-1.module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-0ef3b33f1984da88b]
module.us-east-1.module.platform.aws_security_group.allow_ansible_admin_subnet_ssh: Refreshing state... [id=sg-0c412bb5607ba98c8]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:loadbalancer/app/alb-grafana-dashboards-dev/40eea0838773300f]
module.us-east-1.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-08ad62b02168826c01080289494]
module.us-east-1.module.platform.module.bastion.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-08cb1d270aa1debe7]
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=grafana-rds-dev]
module.us-east-1.module.platform.aws_security_group.allow_bastion_ssh: Refreshing state... [id=sg-052e56cc378dd071a]
module.us-east-1.module.platform.module.grafana_dashboards.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-048a87dfb1c81d12a]
module.us-east-1.module.platform.module.ansible_server.module.ec2-instance.aws_instance.this[0]: Refreshing state... [id=i-01c0781c3f9d2cd35]
module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1315982555]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:listener/app/alb-grafana-dashboards-dev/40eea0838773300f/6d7d7783daa535d3]
module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group_attachment.this["0.target"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d-20220826073634953100000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0] has changed
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:023093918714:listener/app/alb-grafana-dashboards-dev/40eea0838773300f/6d7d7783daa535d3"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-06f2a2d1d405e2ede"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.2.162/32",
                ]
              + description      = "PostgreSQL access from within VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "grafana_db-dev-20220826071916495300000004"
        tags                   = {
            "Name" = "grafana_db-dev"
        }
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.us-east-1.module.platform.module.bastion.aws_security_group.bastion_public_ssh will be updated in-place
  ~ resource "aws_security_group" "bastion_public_ssh" {
        id                     = "sg-04ecf420f20362e1e"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          - {
              - cidr_blocks      = [
                  - "201.33.195.0/24",
                  - "201.33.205.0/24",
                ]
              - description      = ""
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
        ]
        name                   = "bastion_public_ssh-dev"
        tags                   = {
            "Name" = "ssh"
        }
        # (7 unchanged attributes hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.grafana_http_instance will be updated in-place
  ~ resource "aws_security_group" "grafana_http_instance" {
        id                     = "sg-0f7851c5f42fbdba8"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
          - {
              - cidr_blocks      = [
                  - "201.33.195.0/24",
                  - "201.33.205.0/24",
                ]
              - description      = ""
              - from_port        = 3000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 3000
            },
        ]
        name                   = "grafana_http_instance-dev"
        tags                   = {
            "Name" = "grafana-dashboards"
        }
        # (7 unchanged attributes hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_http will be updated in-place
  ~ resource "aws_security_group" "sg_grafana_http" {
        id                     = "sg-0f64dadaff4382374"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "201.33.195.0/24",
                  - "201.33.205.0/24",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ]
        name                   = "alb_grafana_http-dev"
        tags                   = {
            "Name" = "grafana-dashboards"
        }
        # (7 unchanged attributes hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_https will be updated in-place
  ~ resource "aws_security_group" "sg_grafana_https" {
        id                     = "sg-0fa8a44234f244f0d"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "201.33.195.0/24",
                  - "201.33.205.0/24",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ]
        name                   = "alb_grafana_https-dev"
        tags                   = {
            "Name" = "grafana-dashboards"
        }
        # (7 unchanged attributes hidden)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0] will be updated in-place
  ~ resource "aws_lb_listener" "frontend_http_tcp" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:023093918714:listener/app/alb-grafana-dashboards-dev/40eea0838773300f/6d7d7783daa535d3"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group.main[0] must be replaced
+/- resource "aws_lb_target_group" "main" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/pref-20220826073633293700000001/294dc35f2896c65d" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "pref-20220826073633293700000001" -> (known after apply)
      ~ name_prefix                        = "pref-" -> "graf-" # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      ~ tags                               = {
          ~ "Name" = "pref-" -> "graf-"
            # (1 unchanged element hidden)
        }
      ~ tags_all                           = {
          ~ "Name"      = "pref-" -> "graf-"
            # (3 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

      ~ health_check {
          ~ enabled             = true -> (known after apply)
          ~ healthy_threshold   = 5 -> (known after apply)
          ~ interval            = 30 -> (known after apply)
          ~ matcher             = "200" -> (known after apply)
          ~ path                = "/" -> (known after apply)
          ~ port                = "traffic-port" -> (known after apply)
          ~ protocol            = "HTTP" -> (known after apply)
          ~ timeout             = 5 -> (known after apply)
          ~ unhealthy_threshold = 2 -> (known after apply)
        }

      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          + cookie_name     = (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group_attachment.this["0.target"] must be replaced
-/+ resource "aws_lb_target_group_attachment" "this" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d-20220826073634953100000002" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:023093918714:targetgroup/pref-20220826073633293700000001/294dc35f2896c65d" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.

Warning: Reference to undefined provider

  on main.tf line 22, in module "us-east-1":
  22:     aws = aws.use1

There is no explicit declaration for local provider name "aws" in
module.us-east-1, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kaio6fellipe, Action: `pull_request`*